/*
#include<unistd.h>
extern char **environ;
×××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××
int execl(const char *pathname,const char *arg0,...);
----pathname表示执行文件的路径(这个pathname包括了文件的名称)。
----接下来的参数代表执行该参数时传递的命令行参数；最后一个参数必须用空指针作为结束标志。
----返回：执行成功不会返回，失败则直接返回-1;
----功能：加载一个可执行文件到进程空间中，替代进程原来的代码和数据，在调用execl（ｌ是list的缩写）函数时传入的命令行参数作为新执行的文件命令行参数传入。

××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××
int execle(const char *pathname,const char *arg0,...(char *)0,char *const envp[] );
----execle函数需要在传递命令行参数后传递进程的环境变量表。

×××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××× b
int execlp(const char *filename,const char *arg0,...,(char *)0);
----参数filename:表示所执行文件的路径，系统会将这个文件路径与PATH环境变量结合成一个完整的文件路径，然后执行该文件
----返回：执行成功则函数不会返回，执行失败则直接返回-1;

××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××
int execv(const char *pathname,char *const argv[]);
××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××
int execve(const char *pathname,char *const argv[],char *const envp[])；
----参数envp表示一个环境变量的列表，该列表同样是一个字符串地址的数组，最后以一个"NULL"结束。
××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××××
*/








